verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/david/Documents/dig2/complex/module/i2s.v
read_verilog /home/david/litex/pythondata-cpu-vexriscv/pythondata_cpu_vexriscv/verilog/VexRiscv.v
read_verilog /home/david/Documents/dig2/complex/build/alpha_board/gateware/alpha_board.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top alpha_board
write_json  alpha_board.json